; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared3 - mode
	spectrograph6 - mode
	image2 - mode
	infrared1 - mode
	infrared5 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	image7 - mode
	thermograph9 - mode
	image8 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star5 - direction
	Star1 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star5)
	(supports instrument1 spectrograph6)
	(supports instrument1 image8)
	(supports instrument1 image7)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph9)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph6)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(have_image Planet6 spectrograph4)
	(have_image Planet7 image7)
	(have_image Planet7 infrared3)
	(have_image Planet7 infrared5)
	(have_image Planet8 spectrograph0)
	(have_image Phenomenon9 image8)
	(have_image Planet10 image7)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
2. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 7
3. (turn_to satellite1 planet7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet7)
   goals met: 0 of 7
4. (take_image satellite1 planet7 instrument3 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 1 of 7
5. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (take_image satellite1 planet6 instrument3 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 2 of 7
10. (turn_to satellite0 planet7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet7)
   goals met: 2 of 7
11. (take_image satellite0 planet7 instrument0 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 3 of 7
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 7
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 7
14. (turn_to satellite0 star1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star1)
   goals met: 3 of 7
15. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 3 of 7
16. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 7
17. (take_image satellite0 phenomenon9 instrument1 image8)
   added: (have_image phenomenon9 image8)
   goals met: 4 of 7
18. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 4 of 7
19. (take_image satellite0 planet10 instrument1 image7)
   added: (have_image planet10 image7)
   goals met: 5 of 7
20. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 5 of 7
21. (take_image satellite0 planet7 instrument1 image7)
   added: (have_image planet7 image7)
   goals met: 6 of 7
22. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 6 of 7
23. (take_image satellite1 planet8 instrument3 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 7 of 7
